<?php
// if (!defined("_GNUBOARD_")) exit; // 개별 페이지 접근 불가

if ($default['de_card_test']) {
    $default['de_nicepay_mid'] = 'nicepay00m';
    $default['de_nicepay_sign_key'] = 'EYzu8jGGMfqaDEp76gSckuvnaHHu+bC4opsSN6lHv3b2lurNYkVXrZ7Z1AoqQnXI3eLuaUFyoRNC6FkrzVjceg==';
    // $default['de_nicepay_admin_key'] = '1111';
} else {
}
    
//     if( !defined('G5_MOBILE_nicepay_SETTLE') ){
//         $default['de_nicepay_mid'] = "SIR".$default['de_nicepay_mid'];
//     }

//     if ($default['de_escrow_use'] == 1) {
//         // 에스크로결제
//         $useescrow = ':useescrow';
//     }
//     else {
//         // 일반결제
//         $useescrow = '';
//     }
// }

require_once(G5_SHOP_PATH."/nicepay/lib/NicepayLite.php");

$mid = $default['de_nicepay_mid'];
$signKey = $default['de_nicepay_sign_key'];

$siteDomain = G5_SHOP_URL.'/nicepay';

$nicepay = new NicepayLite;

$nicepay->m_NicepayHome = G5_SHOP_PATH."/nicepay/log";
$nicepay->m_log = "true";
$nicepay->m_MID = $mid;
$nicepay->m_MerchantKey = $signKey;

$nicepay->requestProcess();

$BANK_CODE = array(
    '001'   => '한국은행',
    '002'   => '산업은행',
    '003'   => '기업은행',
    '004'   => '국민은행',
    '007'   => '수협은행',
    '008'   => '수출입은행',
    '011'   => '농협은행',
    '012'   => '지역 농축협',
    '020'   => '우리은행',
    '023'   => 'SC제일은행',
    '027'   => '한국씨티은행',
    '031'   => '대구은행',
    '032'   => '부산은행',
    '034'   => '광주은행',
    '035'   => '제주은행',
    '037'   => '전북은행',
    '039'   => '경남은행',
    '045'   => '새마을금고중앙회',
    '048'   => '신협',
    '050'   => '저축은행',
    '051'   => '기타 외국계은행',
    '052'   => '모건스탠리은행',
    '054'   => 'HSBC은행',
    '055'   => '도이치은행',
    '057'   => '제이피모간체이스은행',
    '058'   => '미즈호은행',
    '059'   => '엠유에프지은행',
    '060'   => 'BOA은행',
    '061'   => '비엔피파리은행', 
    '062'   => '중국공상은행',
    '063'   => '중국은행',
    '064'   => '산립조합중앙회',
    '065'   => '대화은행',
    '066'   => '교통은행',
    '067'   => '중국건설은행',
    '071'   => '우체국',
    '076'   => '신용보증기금',
    '077'   => '기술보증기금',
    '081'   => '하나은행',
    '088'   => '신한은행',
    '089'   => '케이뱅크',
    '090'   => '카카오뱅크',
    '091'   => '국세청',
    '093'   => '한국주택금융공사',
    '094'   => '서울보증보험',
    '095'   => '경찰청',
    '096'   => '한국전자금융(주)',
    '099'   => '금융결제원',
    '101'   => '한국신용정보원',
    '102'   => '대신저축은행',
    '103'   => '에스비아이저축은행',
    '104'   => '에이치케이저축은행',
    '105'   => '웰컴저축은행',
    '209'   => '유안타증권',
    '218'   => 'KB증권',
    '221'   => '골든브릿지투자증권',
    '222'   => '한양증권',
    '223'   => '리딩투자증권',
    '224'   => 'BNK투자증권',
    '225'   => 'IBK투자증권',
    '227'   => 'KTB투자증권',
    '238'   => '미래에셋대우',
    '240'   => '삼성증권',
    '243'   => '한국투자증권',
    '247'   => 'NH투자증권',
    '261'   => '교보증권',
    '262'   => '하이투자증권',
    '263'   => '현대차증권',
    '264'   => '키움증권',
    '265'   => '이베스트투자증권',
    '266'   => 'SK증권',
    '267'   => '대신증권',
    '269'   => '한화투자증권',
    '270'   => '하나금융투자',
    '278'   => '신한금융투자',
    '279'   => 'DB금융투자',
    '280'   => '유진투자증권',
    '287'   => '메리츠종합금융증권',
    '289'   => 'NH투자증권',
    '290'   => '부국증권',
    '291'   => '신영증권',
    '292'   => '케이프투자증권',
    '293'   => '한국증권금융',
    '294'   => '펀드온라인코리아',
    '295'   => '우리종합금융',
    '299'   => '아주캐피탈'
);

$CARD_CODE = array(
    '01'    => '비씨',
    '02'    => '국민',
    '03'    => '외환',
    '04'    => '삼성',
    '06'    => '신한',
    '07'    => '현대',
    '08'    => '롯데',
    '09'    => '한미',
    '10'    => '신세계한미',
    '11'    => '시티',
    '12'    => '농협',
    '13'    => '수협',
    '14'    => '평화',
    '15'    => '우리',
    '16'    => '하나',
    '17'    => '동남(주택)',
    '18'    => '주택',
    '19'    => '조흥(강원)',
    '20'    => '축협(농협)',
    '21'    => '광주',
    '22'    => '전북',
    '23'    => '제주',
    '24'    => '산은',
    '25'    => '해외비자',
    '26'    => '해외마스터',
    '27'    => '해외다이너스',
    '28'    => '해외AMX',
    '29'    => '해외JCB',
    '31'    => 'SK-OKCashBag',
    '32'    => '우체국',
    '33'    => '저축은행'
);



?>